package com.offcn.demos;

public class Demo2 {
    public static void main(String[] args) {
/*        案例1:  十进制25转十进制;
        二进制0b111转十进制;
        八进制072转十进制;
        十六进制0x4ab转十进制;*/

/*        .转换方式: 分别计算每一个 基数乘以系数的权次幂 再求和;
        转换方式解析:
        基数: 指定进制数据中的每一位数
        系数: 进制数
        权次幂: 基数后数据位数*/

        System.out.println("========十进制=======");
        //1.十进制25转十进制
        int x10 = 25;
        //计算过程：
        //2*10^1 = 2 * 10 = 20
        //5*10^0 = 5 * 1 = 5
        //求和：20 + 5 = 25
        System.out.println(x10);
        System.out.println("========二进制=======");
        //2.二进制0b111转十进制;
        int x2 = 0b111;
        //计算过程
        //1*2^2 = 1*4 = 4;
        //1*2^1 = 1*2 = 2;
        //1*2^0 = 1*1 = 1;
        //求和：4 + 2 + 1 = 7
        System.out.println(x2);
        System.out.println("========八进制=======");
        //3.八进制072转十进制;
        int x8 = 072;
        //计算过程
        //7*8^1 = 7 * 8 =56;
        //2*8^0 = 2 * 1 = 2;
        //求和：56 + 2 = 58；
        System.out.println(x8);
        System.out.println("========十六进制=======");
        //4.十六进制0x4ab转十进制
        int x16 = 0x4ab;
        //计算过程
        //4*16^2 = 4 * 256 = 1024;
        //a*16^1 = 10* 16 = 160;
        //b*16^0 = 11* 1 = 11;
        //求和： 1024 + 160 + 11 =1195；
        System.out.println(x16);
    }
}
